espressif/esp-idf/components/soc/esp32h4/register/soc/pvt_reg.h
/** PVT_DBIAS_CHANNEL2_SEL_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL2_SEL_REG (DR_REG_PVT_BASE + 0x44)
/** PVT_DBIAS_CHANNEL2_CFG : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL2_CFG    0x0001FFFFU
#define PVT_DBIAS_CHANNEL2_CFG_M  (PVT_DBIAS_CHANNEL2_CFG_V << PVT_DBIAS_CHANNEL2_CFG_S)
#define PVT_DBIAS_CHANNEL2_CFG_V  0x0001FFFFU
#define PVT_DBIAS_CHANNEL2_CFG_S  0

/** PVT_DBIAS_CHANNEL3_SEL_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL3_SEL_REG (DR_REG_PVT_BASE + 0x48)
/** PVT_DBIAS_CHANNEL3_CFG : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL3_CFG    0x0001FFFFU
#define PVT_DBIAS_CHANNEL3_CFG_M  (PVT_DBIAS_CHANNEL3_CFG_V << PVT_DBIAS_CHANNEL3_CFG_S)
#define PVT_DBIAS_CHANNEL3_CFG_V  0x0001FFFFU
#define PVT_DBIAS_CHANNEL3_CFG_S  0

/** PVT_DBIAS_CHANNEL4_SEL_REG register
 *  needs desc
 */
#define PVT_DBIAS_CHANNEL4_SEL_REG (DR_REG_PVT_BASE + 0x4c)
/** PVT_DBIAS_CHANNEL4_CFG : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CHANNEL4_CFG    0x0001FFFFU
#define PVT_DBIAS_CHANNEL4_CFG_M  (PVT_DBIAS_CHANNEL4_CFG_V << PVT_DBIAS_CHANNEL4_CFG_S)
#define PVT_DBIAS_CHANNEL4_CFG_V  0x0001FFFFU
#define PVT_DBIAS_CHANNEL4_CFG_S  0

/** PVT_DBIAS_CMD0_REG register
 *  needs desc
 */
#define PVT_DBIAS_CMD0_REG (DR_REG_PVT_BASE + 0x50)
/** PVT_DBIAS_CMD0 : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CMD0    0x0001FFFFU
#define PVT_DBIAS_CMD0_M  (PVT_DBIAS_CMD0_V << PVT_DBIAS_CMD0_S)
#define PVT_DBIAS_CMD0_V  0x0001FFFFU
#define PVT_DBIAS_CMD0_S  0

/** PVT_DBIAS_CMD1_REG register
 *  needs desc
 */
#define PVT_DBIAS_CMD1_REG (DR_REG_PVT_BASE + 0x54)
/** PVT_DBIAS_CMD1 : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CMD1    0x0001FFFFU
#define PVT_DBIAS_CMD1_M  (PVT_DBIAS_CMD1_V << PVT_DBIAS_CMD1_S)
#define PVT_DBIAS_CMD1_V  0x0001FFFFU
#define PVT_DBIAS_CMD1_S  0

/** PVT_DBIAS_CMD2_REG register
 *  needs desc
 */
#define PVT_DBIAS_CMD2_REG (DR_REG_PVT_BASE + 0x58)
/** PVT_DBIAS_CMD2 : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CMD2    0x0001FFFFU
#define PVT_DBIAS_CMD2_M  (PVT_DBIAS_CMD2_V << PVT_DBIAS_CMD2_S)
#define PVT_DBIAS_CMD2_V  0x0001FFFFU
#define PVT_DBIAS_CMD2_S  0

/** PVT_DBIAS_CMD3_REG register
 *  needs desc
 */
#define PVT_DBIAS_CMD3_REG (DR_REG_PVT_BASE + 0x5c)
/** PVT_DBIAS_CMD3 : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CMD3    0x0001FFFFU
#define PVT_DBIAS_CMD3_M  (PVT_DBIAS_CMD3_V << PVT_DBIAS_CMD3_S)
#define PVT_DBIAS_CMD3_V  0x0001FFFFU
#define PVT_DBIAS_CMD3_S  0

/** PVT_DBIAS_CMD4_REG register
 *  needs desc
 */
#define PVT_DBIAS_CMD4_REG (DR_REG_PVT_BASE + 0x60)
/** PVT_DBIAS_CMD4 : R/W; bitpos: [16:0]; default: 0;
 *  needs field desc
 */
#define PVT_DBIAS_CMD4    0x0001FFFFU
#define PVT_DBIAS_CMD4_M  (PVT_DBIAS_CMD4_V << PVT_DBIAS_CMD4_S)
#define PVT_DBIAS_CMD4_V  0x0001FFFFU
#define PVT_DBIAS_CMD4_S  0

/** PVT_DBIAS_TIMER_REG register
 *  needs desc
 */
#define PVT_DBIAS_TIMER_REG (DR_REG_PVT_BASE + 0x64)
/** PVT_TIMER_TARGET : R/W; bitpos: [30:15]; default: 65535;
 *  needs field desc
 */
#define PVT_TIMER_TARGET    0x0000FFFFU
#define PVT_TIMER_TARGET_M  (PVT_TIMER_TARGET_V << PVT_TIMER_TARGET_S)
#define PVT_TIMER_TARGET_V  0x0000FFFFU
#define PVT_TIMER_TARGET_S  15
/** PVT_TIMER_EN : R/W; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMER_EN    (BIT(31))
#define PVT_TIMER_EN_M  (PVT_TIMER_EN_V << PVT_TIMER_EN_S)
#define PVT_TIMER_EN_V  0x00000001U
#define PVT_TIMER_EN_S  31

/** PVT_COMB_PD_SITE0_UNIT0_VT0_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT0_VT0_CONF1_REG (DR_REG_PVT_BASE + 0x68)
/** PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0    (BIT(0))
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0_M  (PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0_V << PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0_S)
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0_V  0x00000001U
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT0_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0_M  (PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0_V << PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0_S)
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT0_S  1
/** PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0    0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0_M  (PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0_V << PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0_S)
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT0_S  2
/** PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0    0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0_M  (PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0_V << PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0_S)
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT0_S  23
/** PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0    (BIT(31))
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0_M  (PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0_V << PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0_S)
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0_V  0x00000001U
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT0_S  31

/** PVT_COMB_PD_SITE0_UNIT1_VT0_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT1_VT0_CONF1_REG (DR_REG_PVT_BASE + 0x6c)
/** PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1    (BIT(0))
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1_M  (PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1_V << PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1_S)
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1_V  0x00000001U
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT1_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1_M  (PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1_V << PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1_S)
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT1_S  1
/** PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1    0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1_M  (PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1_V << PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1_S)
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT1_S  2
/** PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1    0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1_M  (PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1_V << PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1_S)
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT1_S  23
/** PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1    (BIT(31))
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1_M  (PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1_V << PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1_S)
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1_V  0x00000001U
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT1_S  31

/** PVT_COMB_PD_SITE0_UNIT2_VT0_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT2_VT0_CONF1_REG (DR_REG_PVT_BASE + 0x70)
/** PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2    (BIT(0))
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2_M  (PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2_V << PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2_S)
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2_V  0x00000001U
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT2_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2_M  (PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2_V << PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2_S)
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT2_S  1
/** PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2    0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2_M  (PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2_V << PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2_S)
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT2_S  2
/** PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2    0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2_M  (PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2_V << PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2_S)
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT2_S  23
/** PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2    (BIT(31))
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2_M  (PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2_V << PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2_S)
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2_V  0x00000001U
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT2_S  31

/** PVT_COMB_PD_SITE0_UNIT3_VT0_CONF1_REG register
 *  needs desc
 */
#define PVT_COMB_PD_SITE0_UNIT3_VT0_CONF1_REG (DR_REG_PVT_BASE + 0x74)
/** PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3 : R/W; bitpos: [0]; default: 0;
 *  needs field desc
 */
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3    (BIT(0))
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3_M  (PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3_V << PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3_S)
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3_V  0x00000001U
#define PVT_MONITOR_EN_VT0_PD_SITE0_UNIT3_S  0
/** PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3 : WT; bitpos: [1]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3    (BIT(1))
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3_M  (PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3_V << PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3_S)
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3_V  0x00000001U
#define PVT_TIMING_ERR_CNT_CLR_VT0_PD_SITE0_UNIT3_S  1
/** PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3 : R/W; bitpos: [9:2]; default: 20;
 *  needs field desc
 */
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3    0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3_M  (PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3_V << PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3_S)
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3_V  0x000000FFU
#define PVT_DELAY_LIMIT_VT0_PD_SITE0_UNIT3_S  2
/** PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3 : RO; bitpos: [30:23]; default: 0;
 *  needs field desc
 */
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3    0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3_M  (PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3_V << PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3_S)
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3_V  0x000000FFU
#define PVT_DELAY_NUM_O_VT0_PD_SITE0_UNIT3_S  23
/** PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3 : RO; bitpos: [31]; default: 0;
 *  needs field desc
 */
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3    (BIT(31))
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3_M  (PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3_V << PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3_S)
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3_V  0x00000001U
#define PVT_TIMING_ERR_VT0_PD_SITE0_UNIT3_S  31

